<a href="https://colab.research.google.com/github/madhavimali/SQL_SQLZoo_HackerRank_Practice_Questions_with_Solutions/blob/main/SQL_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

High pollution
Easy
From the following dataframe, write a SQL query to find all dates' city ID with higher pollution compared to its previous dates (yesterday). Return city ID, date and pollution.

In [ ]:
-- Write your query here
SELECT s.city_id 
FROM so2_pollution as s
  JOIN
so2_pollution p ON 
 julianday(s.date)- julianday(p.date) =1
        AND s.so2_amt > p.so2_amt;

In [ ]:
SELECT p.city_id 
FROM so2_pollution as s
  JOIN
so2_pollution p ON 
 julianday(p.date)- julianday(s.date) =1
        AND p.so2_amt > s.so2_amt;

From the following dataframe, write a SQL query to find all the duplicate emails of employees keeping the unique email with the greater employee id. Return employee id and duplicate emails.

In [ ]:
select * from employees
except
select employee_id, employee_name, email_id
from employees
group by email_id

From the following Dataframes, write a SQL query to find those customers who never ordered anything. Return customer name.

In [ ]:
select customer_name 
from customers 
where customer_id 
in (select customer_id
from customers
except 
select customer_id
from orders)

A salesperson is a person whose job is to sell products or services. From the following dataframe, write a SQL query to find the top 10 salesperson that have made highest sale. Return their names and total sale amount.

Table-I: sales

Table-II: salesman

In [ ]:
select SALESMAN_NAME, sum (SALE_AMOUNT) as total_sale
from salesman as s join sales as s1 on s.SALESMAN_ID = s1.SALESMAN_ID
group by s1.SALESMAN_ID 
order by total_sale desc
limit 10

From the following dataframes, write a SQL query to find the information on each salesperson of ABC Company. Return name, city, country and state of each salesperson.

Table-I: salespersons

Table-II: address

In [ ]:
select s.first_name, s.last_name, a.city, a.state
from salespersons  as s left join address as a on 
s.salesperson_id = a.salesperson_id

What is the number and percentage of customer plans after their initial free trial?

Table-I: plans

Table-II: subscriptions

In [ ]:
select distinct s.plan_id as next_plan, count (s.plan_id) as conversions, count ( s.plan_id) as conversion_percentage
from subscriptions as s
join plans as p on s.plan_id = p.plan_id
where s.plan_id > 0

Write a query identifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:

Equilateral: It's a triangle with 3 sides of equal length.

Isosceles: It's a triangle with 2 sides of equal length.

Scalene: It's a triangle with 3 sides of differing lengths.

Not A Triangle: The given values of A, B, and C don't form a triangle.

In [ ]:
select if(A+B<=C or B+C<=A or A+C<=B,"Not A Triangle",
if(A=B and B=C,"Equilateral",
if(A=B or B=C or A=C,"Isosceles","Scalene")))
from TRIANGLES as T

Query the Name of any student in STUDENTS who scored higher than  75 Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

In [ ]:
select name from students
where marks > 75
order by right(name, 3), id asc

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where city not regexp '^[aeiou]'
and city not regexp '[aeiou]$'

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city
from station
where city not regexp '^[aeiou]'
or   city not regexp '[aeiou]$'

In [ ]:
select distinct city from station 
where (city not like '%a' and city not like '%e' and city not like '%i' and city not like '%o' and city not like '%u') or
 (city not like 'a%' and city not like 'e%' and city not like 'i%' and city not like 'o%' and city not like 'u%')

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where city not like '%a' and city not like '%e' and city not like '%i' and city not like '%o' and city not like '%u'

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where city not like 'a%' and city not like 'e%' and city not like 'i%' and city not like 'o%' and city not like 'u%'

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where (city like 'a%' or city like 'e%' or city like 'i%' or city like 'o%' or city like 'u%') and (city like '%a' or city like '%e' or city like '%i' or city like '%o' or city like '%u')

SyntaxError: ignored

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

In [ ]:
select distinct city from station 
where city like '%a' or city like '%e' or city like '%i' or city like '%o' or city like '%u'

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

In [ ]:
select distinct city from station 
where city like 'a%' or city like 'e%' or city like 'i%' or city like 'o%' or city like 'u%'

Q. 15 List all the people who have worked with 'Art Garfunkel'.

In [ ]:
select actor.name 
from actor join casting on casting.actorid = actor.id         
           join movie on casting.movieid = movie.id 
           
where movie.title in 
(select title 
from movie join casting on casting.movieid = movie.id 
           join actor on casting.actorid = actor.id
where actor.name =  'Art Garfunkel')
and actor.name != 'Art Garfunkel'
order by actor.name

#Self Join

How many stops are in the database.

In [ ]:
select count(id) from stops

Find the id value for the stop 'Craiglockhart'

In [ ]:
select * from route

Give the id and the name for the stops on the '4' 'LRT' service.

In [ ]:
select stops.id, stops.name from stops 
join route on stops.id = route.stop
where company = 'LRT' and num = '4'

The query shown gives the number of routes that visit either London Road (149) or Craiglockhart (53). Run the query and notice the two services that link these stops have a count of 2. Add a HAVING clause to restrict the output to these two routes.

In [ ]:
SELECT company, num, count(stop)
FROM stops join route on stops.id = route.stop
 WHERE stop=149 OR stop=53
GROUP BY company, num
having count(stop) >= 2

Execute the self join shown and observe that b.stop gives all the places you can get to from Craiglockhart, without changing routes. Change the query so that it shows the services from Craiglockhart to London Road.

In [ ]:
SELECT a.company, a.num, a.stop, b.stop
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
WHERE a.stop= (select id from stops where name = 
               'Craiglockhart')
 and b.stop = (select id from stops where name = 'London Road')

The query shown is similar to the previous one, however by joining two copies of the stops table we can refer to stops by name rather than by number. Change the query so that the services between 'Craiglockhart' and 'London Road' are shown. If you are tired of these places try 'Fairmilehead' against 'Tollcross'

In [ ]:
SELECT a.company, a.num, stopa.name, stopb.name
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
  JOIN stops stopa ON (a.stop=stopa.id)
  JOIN stops stopb ON (b.stop=stopb.id)
WHERE 
(stopa.name='Craiglockhart' and stopb.name = 'London Road')
or
(stopb.name= 'Fairmilehead' and stopb.name=  'Tollcross')